 x=[-1,1,2,3,4,5] ;
 y=[4,2.5,4,3.2,5.1,7.4];
 p2=polyfit(x,y,2) %κατασκευή πολυώνυμο ελαχ. τετραγώνων 2ου βαθμού
p2 = [0.2845 -0.6081 3.1300];
 p5=polyfit(x,y,5) %κατασκευή πολυώνυμο ελαχ. τετραγώνων 5ου βαθμού
p5 = [-0.0943 1.1104 -4.1410 4.4229 3.4853 -2.2833];
 xi=linspace(-1,5,100); %δημιουργία δεδομένων στον άξονα των x
 z2=polyval(p2,xi); %δημιουργία δεδομένων στον άξονα των y για το p2
 z5=polyval(p5,xi); %δημιουργία δεδομένων στον άξονα των y για το p5
 plot(x,y,'o',xi,z2,':',xi,z5) %σχεδίαση γραφημάτων για τα p2 και p5
%το γράφημα του p2 είναι με διακεκομμένη γραμμή
 xlabel('x'),ylabel('y=f(x)'), %ενδείξεις στους άξονες
 title('2nd and 5th order Curve Fitting') %έκδοση τίτλου γραφήματοs